Revit 2027 API
FormatOptions.CanSuppressLeadingZeros Method
 Checks whether leading zeros can be suppressed for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanSuppressLeadingZeros()
Public Function CanSuppressLeadingZeros As Boolean
public:
bool CanSuppressLeadingZeros()
member CanSuppressLeadingZeros : unit -> bool
Return Value
Boolean
 True if leading zeros can be suppressed, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
Reference
FormatOptions Class
CanSuppressLeadingZeros Overload
Autodesk.Revit.DB Namespace